src/test/taurus/test.yml
---
execution:
- concurrency: 10
  hold-for: 2m
  ramp-up: 40s
  scenario: Thread Group
scenarios:
  Thread Group:
    requests:
    - label: blazedemo
      method: GET
      url: http://blazedemo.com/
    - body:
        fromPort: Paris
        toPort: Buenos Aires
      label: reserve
      method: POST
      url: http://blazedemo.com/reserve.php

reporting:
- module: console
#- module: final-stats
#  summary: true
#  percentiles: true
#  failed-labels: false
#  test-duration: true
#  dump-csv: TaurusResult/perf_result_csv.csv
- module: junit-xml
  data-source: pass-fail
  filename: TaurusResult/junit-result.xml
- module: final-stats
  dump-xml: stats.xml
#modules:
#  blazemeter:
#    token: 412d5a8846c9883881798394:57e11097a3b10a5645b9784680cca648bfeb576a0af7fb2110a98be4dabb4516fb09b19c  # API id and API secret joined with ':'
#    test: Taurus Local Test  # name for test to store reports
#    project: My Taurus Project  # name for project to store test, can be numeric project ID
#    public-report: false  # set to true to create a public link to the report